# Statistical Analysis of Data, Plus Data Cleaning

### Goals:

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use `info`, `describe` and `dtype`
  - Use `mean`, `min`, `max`, and `value_counts` 
- Use `apply` and `applymap` to transform columns and create new values
- Explain `lambda` functions and use them to use an `apply` on a DataFrame
- Explain what a `groupby` object is and split a DataFrame using a `groupby`
- Reshape a DataFrame using `join`, `merge`, `pivot`, and `melt`

## Data

Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci

![heart-data](heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset 

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [2]:
!pwd
!ls

/Users/lberlin/Documents/Lectures/Mod1/001mod-005sec-data-cleaning-in-pandas
README.md                           manipulating-data-pandas-2.md
ds_chars.csv                        manipulating_data_with_pandas.ipynb
export_csv.png                      pre_process_animal_shelter_data.py
heart.csv                           states.csv
heartbloodpres.jpeg

In [3]:
import pandas as pd
uci_df = pd.read_csv('heart.csv')

In [4]:
uci_df.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### Attributes

In [5]:
uci_df.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [19]:
# Check the .shape method on our dataset. What do you observe?

#### Methods

In [7]:
# Call the .info() method on our dataset. What do you observe?

In [9]:
# Call the .describe() method on our dataset. What do you observe?

In [11]:
# Use the code below. How does the output differ from info() ?
uci_df.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

The methods `.mean()`, `.min()`, `.max()`, and `.sum()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [12]:
uci_df.mean()

age          54.366337
sex           0.683168
cp            0.966997
trestbps    131.623762
chol        246.264026
fbs           0.148515
restecg       0.528053
thalach     149.646865
exang         0.326733
oldpeak       1.039604
slope         1.399340
ca            0.729373
thal          2.313531
target        0.544554
dtype: float64

In [20]:
#Let's check the rest of those methods

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [15]:
uci_df['age'].value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

#### What are the different values for `restecg`?

In [16]:
# Your code here!

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [23]:
# Originally looks like:
uci_df.head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

In [30]:
# Defining a function to test this...
def add_one(x):
    return x + 1

In [31]:
# Look!
uci_df.applymap(add_one).head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2
5,58,2,1,141,193,1,2,149,1,1.4,2,1,2,2
6,57,1,2,141,295,1,1,154,1,2.3,2,1,3,2
7,45,2,2,121,264,1,2,174,1,1.0,3,1,4,2
8,53,2,3,173,200,2,2,163,1,1.5,3,1,4,2
9,58,2,3,151,169,1,2,175,1,2.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [32]:
# Can you see how this is different from applymap?
uci_df['age'].map(add_one).tail()

298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [29]:
# Originally looks like:
uci_df['oldpeak'][:10]

0    2.3
1    3.5
2    1.4
3    0.8
4    0.6
5    0.4
6    1.3
7    0.0
8    0.5
9    1.6
Name: oldpeak, dtype: float64

In [28]:
# I like to read this as 'for each x in this series, df[column], round x'
uci_df['oldpeak'].map(lambda x: round(x))[:10]

0    2
1    4
2    1
3    1
4    1
5    0
6    1
7    0
8    0
9    2
Name: oldpeak, dtype: int64

#### Use an anonymous function to turn the entries in `age` to strings:

In [45]:
# Your code here!

dtype('int64')

### Further Practice - Animal Shelter Data on Animal Outcomes

Let's take a moment to examine the [Austin Animal Center outcomes data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

Before doing anything else let's use `.info()` and `.describe()` and `dtypes` - what observations can we make about the data?

In [34]:
animal_df = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

Let's rename the columns to something a bit more code-friendly.

In [35]:
# Originally:
animal_df.columns

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [ ]:
# Change the column names here - hint, use a list!

What are the breed `value_counts`?

How about outcome counts for dogs?

_Hint_ <br>
Remember we did filtering in a previous lesson like this:<br>
`customer_df.loc[customer_df["state"]=='OR']`

In [36]:
# Your code here - check for breed value counts

In [37]:
# Your code here - check outcomes based on animal type to get dog outcomes

### Datetime Objects

We want to get the average age of animals, but the age variable is a mess.

Use a `map` to help change the dates from strings to datetime objects. 

- First use `map` to grab only the first 10 characters of date
- Second,  we can use `to_datetime` to convert the remaining characters to a datetime object

[For further reading on datetime formats, go here](http://strftime.org/)

In [45]:
# How do we know that the original DateTime column isn't the right type?
animal_df.dtypes

Animal ID                   object
Name                        object
DateTime            datetime64[ns]
MonthYear                   object
Date of Birth               object
Outcome Type                object
Outcome Subtype             object
Animal Type                 object
Sex upon Outcome            object
Age upon Outcome            object
Breed                       object
Color                       object
dtype: object

In [41]:
# Can you parse out exactly what this code is doing, and why?
animal_df['DateTime'] = pd.to_datetime(
    animal_df['DateTime'].map(lambda x: x[:10]), format='%m/%d/%Y')

In [42]:
animal_df.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A720371,Moose,2016-02-13,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
1,A674754,NaN,2014-03-18,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
2,A689724,*Donatello,2014-10-18,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
3,A680969,*Zeus,2014-08-05,08/05/2014 04:59:00 PM,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby
4,A684617,NaN,2014-07-27,07/27/2014 09:00:00 AM,07/26/2012,Transfer,SCRP,Cat,Intact Female,2 years,Domestic Shorthair Mix,Black

Let's do the same to the 'date of birth' column:

In [43]:
# Your code here

In [44]:
animal_df.dtypes

Animal ID                   object
Name                        object
DateTime            datetime64[ns]
MonthYear                   object
Date of Birth               object
Outcome Type                object
Outcome Subtype             object
Animal Type                 object
Sex upon Outcome            object
Age upon Outcome            object
Breed                       object
Color                       object
dtype: object

Now, create a new variable `age_in_days` by subtracting `dob` from `date`:

In [46]:
# Your code here

Use `map` again to convert `age_in_days` to `years_old` with the `lambda` function `x.days/365`

In [60]:
# Code code code

In [47]:
# Time for a sanity check:

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [64]:
# What object type does this return?
uci_df.groupby('sex')

#### `.groups` and `.get_group()`

In [66]:
uci_df.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [52]:
uci_df.groupby('sex').get_group(0).tail()

### Aggregating

In [68]:
uci_df.groupby('sex').std()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,9.409396,0.972427,19.311119,65.088946,0.332455,0.557150,20.047969,0.422503,1.119844,0.593736,0.881026,0.441290,0.435286
1,8.883803,1.059064,16.658246,42.782392,0.366955,0.510754,24.130882,0.484505,1.174632,0.627378,1.074082,0.659949,0.498626

**Exercise:** Find the average cholesterol level for those with heart disease.

In [78]:
# Your code here!

uci_df.groupby('target')['chol'].mean()
#uci.groupby('target').get_group(0)['chol'].mean()

target
0    251.086957
1    242.230303
Name: chol, dtype: float64

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

In [ ]:
# Your code here

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [79]:
uci_df.pivot(values = 'sex', columns = 'target').tail(10)

target    0   1
293     1.0 NaN
294     1.0 NaN
295     1.0 NaN
296     0.0 NaN
297     1.0 NaN
298     0.0 NaN
299     1.0 NaN
300     1.0 NaN
301     1.0 NaN
302     0.0 NaN

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

Really quick, let's use some tiny toy dataframes to show these techniques.

### `.join()`

In [80]:
# Creating toy dataframes - what should these look like on their own?
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [81]:
# What arguments are we passing into this function and why?
toy1.join(toy2.set_index('age'), on = 'age',
          lsuffix = '_A', rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

### `.merge()`

In [82]:
people_df = pd.read_csv('ds_chars.csv', index_col = 0)
people_df.head()

In [83]:
states_df = pd.read_csv('states.csv', index_col = 0)
states_df.head()

In [89]:
# Let's break this down too, what arguments are we passing?
merged_df = people_df.merge(states_df, left_on='home_state', right_on='state',
                            how='inner')

### `pd.concat()`

**Exercise:** Look up the documentation on [pd.concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.

Your result should still have only five rows!

In [51]:
#Your code here

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [90]:
pd.melt(merged_df, id_vars='HP')

     HP    variable       value
0   200        name        greg
1   200        name       miles
2   170        name        alan
3   200        name      rachel
4   300        name      alison
5   200  home_state          WA
6   200  home_state          WA
7   170  home_state          TX
8   200  home_state          TX
9   300  home_state          DC
10  200       state          WA
11  200       state          WA
12  170       state          TX
13  200       state          TX
14  300       state          DC
15  200    nickname   evergreen
16  200    nickname   evergreen
17  170    nickname       alamo
18  200    nickname       alamo
19  300    nickname    district
20  200     capital     Olympia
21  200     capital     Olympia
22  170     capital      Austin
23  200     capital      Austin
24  300     capital  Washington

## Keep it going! 

Up until now, we've only been working with the outcomes data on our Austin animals. Now, let's join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

You can download the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

_Hints_ :

- import and clean the intake dataset first
    - drop everything but the intake date and the animal id
    - use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days_in_shelter variable
- create a new month_at_intake variable
- notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. Use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here